import numpy as np
import pandas as pd

data = pd.read_csv('adult_test.csv')

# 7. Відобразіть статистику віку для кожної раси ( ознака раси ) та кожної статі ( ознака статі ). Використовуйте groupby() та describe() . Знайдіть максимальний вік чоловіків відповідної Amer-Indian-Eskimoраси.
print(data['Race'].unique())
print(data.groupby(['Sex', 'Race'])['Age'].describe())
'''
                            count       mean        std   min   25%   50%    75%   max
Sex    Race                                                                           
Female Amer-Indian-Eskimo    66.0  34.651515  12.266894  17.0  24.5  33.5  42.50  60.0
       Asian-Pac-Islander   171.0  36.807018  13.255993  18.0  27.0  35.0  45.00  81.0
       Black                753.0  38.013280  12.945460  17.0  27.0  36.0  47.00  73.0
       Other                 46.0  30.108696  10.263697  17.0  23.0  28.5  34.75  64.0
       White               4385.0  37.023489  14.698216  17.0  24.0  35.0  47.00  90.0
Male   Amer-Indian-Eskimo    93.0  36.537634  11.005492  17.0  30.0  34.0  42.00  75.0
       Asian-Pac-Islander   309.0  38.815534  12.710371  18.0  29.0  37.0  46.00  90.0
       Black                808.0  38.388614  13.327352  17.0  28.0  37.0  47.00  81.0
       Other                 89.0  36.101124  12.603251  18.0  27.0  34.0  44.00  67.0
       White               9561.0  39.808807  13.553669  17.0  29.0  38.0  49.00  90.0
'''